src/cfe/package-manager/Catalogs/пм_ИсточникиПакетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пм_ИсточникиПакетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пм_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URLСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеткаКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/package-manager/CommonModules/пм_ПровайдерGitLab/Ext/Module.bsl
#Если Сервер Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет доступность проекта и кэширует идентификатор проекта.
// Реализация контракта провайдера, см. пм_ПровайдерыПакетов.
//
// Параметры:
//  Источник - Структура - См. Справочники.пм_ИсточникиПакетов.ОписаниеИсточника
//
// Возвращаемое значение:
//  Структура - Результат проверки:
// * Успешно - Булево
// * ТекстОшибки - Строка
// * IDПроекта - Строка
//
Функция ПроверитьИсточник(Источник) Экспорт

	Результат = Новый Структура("Успешно, ТекстОшибки, IDПроекта", Ложь, "", "");

	Попытка
		ОбеспечитьIDПроекта(Источник);
		Результат.IDПроекта = Источник.IDПроекта;
		Результат.Успешно = Истина;
	Исключение
		Результат.ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Читает манифест каталога пакетов из репозитория проекта.
//
// Параметры:
//  Источник - Структура - См. Справочники.пм_ИсточникиПакетов.ОписаниеИсточника
//
// Возвращаемое значение:
//  Соответствие - Разобранное содержимое манифеста.
//
Функция ПрочитатьКаталог(Источник) Экспорт

	ОбеспечитьIDПроекта(Источник);

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ref", Источник.ВеткаКаталога);

	Адрес = СтрШаблон("%1/repository/files/%2",
		АдресПроекта(Источник),
		КодированныйСегмент(Источник.ФайлКаталога));

	Ответ = ВыполнитьЗапрос(Источник, Адрес, ПараметрыЗапроса);

	Если Ответ.КодСостояния = 404 Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'В проекте %1 нет файла каталога %2 в ветке %3.'"),
			Источник.ПутьПроекта, Источник.ФайлКаталога, Источник.ВеткаКаталога);
	КонецЕсли;

	ПроверитьОтвет(Источник, Ответ, НСтр("ru = 'Не удалось получить файл каталога пакетов.'"));

	ОтветJSON = пм_КоннекторHTTP.КакJson(Ответ);
	СодержимоеBase64 = ОтветJSON.Получить("content");
	Если СодержимоеBase64 = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Ответ сервера не содержит текста файла каталога.'");
	КонецЕсли;

	СтрокаJSON = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(СодержимоеBase64));

	Попытка
		Возврат пм_ОбщегоНазначения.ЗначениеИзСтрокиJSON(СтрокаJSON, Истина);
	Исключение
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Файл каталога %1 не является корректным JSON.'"),
			Источник.ФайлКаталога);
	КонецПопытки;

КонецФункции

// Возвращает версии пакета, отфильтрованные по типу релиза.
//
// Параметры:
//  Источник - Структура - См. Справочники.пм_ИсточникиПакетов.ОписаниеИсточника
//  ИмяПакета - Строка - Имя package.
//  ТипРелиза - Строка - stable, rc, dev либо пустая строка.
//  ЛимитВерсий - Число - Сколько версий вернуть, 0 без ограничения.
//
// Возвращаемое значение:
//  Массив - Соответствия с данными версий из API.
//
Функция ПолучитьВерсииПакета(Источник, ИмяПакета, ТипРелиза = "", ЛимитВерсий = 0) Экспорт

	ОбеспечитьIDПроекта(Источник);

	Версии = Новый Массив;
	НомерСтраницы = Неопределено;

	// API отдает пакеты постранично: идем по страницам, пока не наберем
	// нужное количество подходящих версий либо не кончатся страницы.
	Пока Истина Цикл

		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("package_type", "generic");
		ПараметрыЗапроса.Вставить("package_name", ИмяПакета);
		ПараметрыЗапроса.Вставить("order_by", "created_at");
		ПараметрыЗапроса.Вставить("sort", "desc");
		ПараметрыЗапроса.Вставить("per_page", 100);
		Если ЗначениеЗаполнено(НомерСтраницы) Тогда
			ПараметрыЗапроса.Вставить("page", НомерСтраницы);
		КонецЕсли;

		Ответ = ВыполнитьЗапрос(Источник, АдресПакетов(Источник), ПараметрыЗапроса);
		ПроверитьОтвет(Источник, Ответ, СтрШаблон(
			НСтр("ru = 'Не удалось получить список версий пакета %1.'"), ИмяПакета));

		СтраницаВерсий = пм_КоннекторHTTP.КакJson(Ответ);

		Для Каждого Версия Из СтраницаВерсий Цикл

			Если Не пм_ВерсииПакетов.ВерсияПодходитПодФильтр(Версия.Получить("version"), ТипРелиза) Тогда
				Продолжить;
			КонецЕсли;

			Версии.Добавить(Версия);

			Если ЛимитВерсий > 0 И Версии.Количество() >= ЛимитВерсий Тогда
				Возврат Версии;
			КонецЕсли;

		КонецЦикла;

		НомерСтраницы = Ответ.Заголовки.Получить("X-Next-Page");
		Если Не ЗначениеЗаполнено(НомерСтраницы) Тогда
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Возврат Версии;

КонецФункции

// Возвращает файлы конкретной версии пакета.
//
// Параметры:
//  Источник - Структура - См. Справочники.пм_ИсточникиПакетов.ОписаниеИсточника
//  IDВерсии - Строка, Число - Идентификатор package из API.
//
// Возвращаемое значение:
//  Массив - Соответствия с описаниями файлов.
//
Функция ПолучитьФайлыВерсии(Источник, IDВерсии) Экспорт

	ОбеспечитьIDПроекта(Источник);

	Адрес = СтрШаблон("%1/%2/package_files", АдресПакетов(Источник), Формат(IDВерсии, "ЧГ=; ЧН=0"));
	Ответ = ВыполнитьЗапрос(Источник, Адрес);

	ПроверитьОтвет(Источник, Ответ, НСтр("ru = 'Не удалось получить список файлов версии пакета.'"));

	Возврат пм_КоннекторHTTP.КакJson(Ответ);

КонецФункции

// Скачивает файл пакета.
//
// Параметры:
//  Источник - Структура - См. Справочники.пм_ИсточникиПакетов.ОписаниеИсточника
//  ИмяПакета - Строка - Имя package.
//  Версия - Строка - Номер версии.
//  ИмяФайла - Строка - Имя файла в package.
//
// Возвращаемое значение:
//  ДвоичныеДанные - Содержимое файла.
//
Функция СкачатьФайл(Источник, ИмяПакета, Версия, ИмяФайла) Экспорт

	ОбеспечитьIDПроекта(Источник);

	Адрес = СтрШаблон("%1/generic/%2/%3/%4",
		АдресПакетов(Источник),
		КодированныйСегмент(ИмяПакета),
		КодированныйСегмент(Версия),
		КодированныйСегмент(ИмяФайла));

	Ответ = ВыполнитьЗапрос(Источник, Адрес);

	Если Ответ.КодСостояния = 404 Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Файл %1 версии %2 пакета %3 не найден в источнике.'"),
			ИмяФайла, Версия, ИмяПакета);
	КонецЕсли;

	ПроверитьОтвет(Источник, Ответ, СтрШаблон(
		НСтр("ru = 'Не удалось скачать файл %1.'"), ИмяФайла));

	Если ТипЗнч(Ответ.Тело) <> Тип("ДвоичныеДанные") Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Сервер вернул файл %1 в неожиданном формате.'"), ИмяФайла);
	КонецЕсли;

	Возврат Ответ.Тело;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяСессия(Источник)

	Сессия = пм_КоннекторHTTP.СоздатьСессию();

	Если ЗначениеЗаполнено(Источник.Токен) Тогда
		Сессия.Заголовки.Вставить("PRIVATE-TOKEN", Источник.Токен);
	КонецЕсли;

	Возврат Сессия;

КонецФункции

// Выполняет GET с таймаутом и одним повтором при сетевой ошибке.
// Повторяется только обрыв связи: HTTP-ответ с любым кодом считается
// состоявшимся и возвращается как есть.
Функция ВыполнитьЗапрос(Источник, Адрес, ПараметрыЗапроса = Неопределено)

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Таймаут", пм_ПровайдерыПакетов.ТаймаутЗапроса());

	Попытка
		Возврат пм_КоннекторHTTP.Get(Адрес, ПараметрыЗапроса, ДополнительныеПараметры, НоваяСессия(Источник));
	Исключение
		ОшибкаПервойПопытки = ИнформацияОбОшибке();
	КонецПопытки;

	Попытка
		Возврат пм_КоннекторHTTP.Get(Адрес, ПараметрыЗапроса, ДополнительныеПараметры, НоваяСессия(Источник));
	Исключение
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Нет связи с сервером %1. Попытка повтора также не удалась.
			|%2'"),
			Источник.URLСервера,
			ПодробноеПредставлениеОшибки(ОшибкаПервойПопытки));
	КонецПопытки;

КонецФункции

Процедура ПроверитьОтвет(Источник, Ответ, ТекстОшибки)

	Если Ответ.КодСостояния >= 200 И Ответ.КодСостояния < 300 Тогда
		Возврат;
	КонецЕсли;

	Если Ответ.КодСостояния = 401 Или Ответ.КодСостояния = 403 Тогда
		Если ЗначениеЗаполнено(Источник.Токен) Тогда
			Пояснение = НСтр("ru = 'Токен доступа отклонен или не дает права read_api на этот проект.'");
		Иначе
			Пояснение = НСтр("ru = 'Проект приватный: заполните токен доступа в источнике.'");
		КонецЕсли;
	ИначеЕсли Ответ.КодСостояния = 404 Тогда
		Пояснение = НСтр("ru = 'Объект не найден. Проверьте путь проекта и имя пакета.'");
	Иначе
		Пояснение = "";
	КонецЕсли;

	ВызватьИсключение СтрШаблон("%1 %2 %3",
		ТекстОшибки,
		СтрШаблон(НСтр("ru = 'Код ответа: %1.'"), Ответ.КодСостояния),
		Пояснение);

КонецПроцедуры

Функция АдресAPI(Источник)

	Возврат Источник.URLСервера + "/api/v4";

КонецФункции

Функция АдресПроекта(Источник)

	Возврат СтрШаблон("%1/projects/%2", АдресAPI(Источник), Источник.IDПроекта);

КонецФункции

Функция АдресПакетов(Источник)

	Возврат АдресПроекта(Источник) + "/packages";

КонецФункции

Функция КодированныйСегмент(Знач Значение)

	Возврат КодироватьСтроку(Значение, СпособКодированияСтроки.КодировкаURL);

КонецФункции

// Разрешает идентификатор проекта по пути и запоминает его в источнике,
// чтобы не резолвить при каждом обращении.
Процедура ОбеспечитьIDПроекта(Источник)

	Если ЗначениеЗаполнено(Источник.IDПроекта) Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Источник.ПутьПроекта) Тогда
		ВызватьИсключение НСтр("ru = 'В источнике не заполнен путь проекта.'");
	КонецЕсли;

	Адрес = СтрШаблон("%1/projects/%2",
		АдресAPI(Источник),
		пм_ПровайдерыПакетов.КодированныйПутьПроекта(Источник.ПутьПроекта));

	Ответ = ВыполнитьЗапрос(Источник, Адрес);

	Если Ответ.КодСостояния = 404 Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Проект %1 не найден на сервере %2.'"),
			Источник.ПутьПроекта, Источник.URLСервера);
	КонецЕсли;

	ПроверитьОтвет(Источник, Ответ, НСтр("ru = 'Не удалось получить проект.'"));

	Проект = пм_КоннекторHTTP.КакJson(Ответ);
	Источник.IDПроекта = Формат(Проект.Получить("id"), "ЧГ=; ЧН=0");

	Справочники.пм_ИсточникиПакетов.ЗапомнитьIDПроекта(Источник.Ссылка, Источник.IDПроекта);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
